let festivals = {
  // 2018
  "2018-02-15": "除夕",
  "2018-02-16": "春节",
  "2018-03-02": "元宵",
  "2018-04-05": "清明",
  "2018-06-18": "端午",
  "2018-08-17": "七夕",
  "2018-09-24": "中秋",
  "2018-10-17": "重阳",
  // 2019
  "2019-02-04": "除夕",
  "2019-02-05": "春节",
  "2019-02-19": "元宵",
  "2019-04-05": "清明",
  "2019-06-07": "端午",
  "2019-08-07": "七夕",
  "2019-09-13": "中秋",
  "2019-10-07": "重阳",
  // 2020
  "2020-01-24": "除夕",
  "2020-01-25": "春节",
  "2020-02-08": "元宵",
  "2020-04-04": "清明",
  "2020-06-25": "端午",
  "2020-08-25": "七夕",
  "2020-10-01": "中秋",
  "2020-10-25": "重阳"
},
  holidays = [
      "2018-01-01",
      "2018-02-15",
      "2018-02-16",
      "2018-02-17",
      "2018-02-18",
      "2018-02-19",
      "2018-02-20",
      "2018-02-21",
      "2018-04-05",
      "2018-04-06",
      "2018-04-07",
      "2018-04-29",
      "2018-04-30",
      "2018-05-01",
      "2018-06-16",
      "2018-06-17",
      "2018-06-18",
      "2018-09-22",
      "2018-09-23",
      "2018-09-24",
      "2018-10-01",
      "2018-10-02",
      "2018-10-03",
      "2018-10-04",
      "2018-10-05",
      "2018-10-06",
      "2018-10-07", // 2018 ~ 2019 new
      "2018-12-30",
      "2018-12-31",
      "2019-01-01",
      "2019-02-04",
      "2019-02-05",
      "2019-02-06",
      "2019-02-07",
      "2019-02-08",
      "2019-02-09",
      "2019-02-10",
      "2019-04-05",
      "2019-04-06",
      "2019-04-07",
      "2019-05-01",
      "2019-06-07",
      "2019-06-08",
      "2019-06-09",
      "2019-09-13",
      "2019-09-14",
      "2019-09-15",
      "2019-10-01",
      "2019-10-02",
      "2019-10-03",
      "2019-10-04",
      "2019-10-05",
      "2019-10-06",
      "2019-10-07",
  ],
  works = [
      "2018-02-11",
      "2018-02-24",
      "2018-04-08",
      "2018-04-28",
      "2018-09-29",
      "2018-09-30", // 2018 ~ 2019 new
      "2018-12-29",
      "2019-02-02",
      "2019-02-03",
      "2019-09-29",
      "2019-10-12",
  ];
/**
* 计算是否是假期
* @param  {string} date 日期 yyyy-mm-dd
* @return {Boolean}  是否为假期
*/
function getHolidays(date) {
  return holidays.indexOf(date) !== -1;
}
/**
* 计算是否需要补班
* @param  {string} date 日期 yyyy-mm-dd
* @return {Boolean}  是否需要补班
*/
function getWorks(date) {
  return works.indexOf(date) !== -1;
}
/**
* 计算公历节日
* @param  {Date} date 日期对象
* @return {string}      节日的中文名称
*/
function getFestival(date) {
  let year = date.getFullYear();
  let month = date.getMonth() + 1;
  let day = date.getDate();
  let datestring = date.format("yyyy-MM-dd");
  let dateStr = festivals[datestring];
  if (dateStr) {
      return dateStr;
  }
  if (month === 1 && day === 1) {
      dateStr = "元旦";
  } else if (month === 2 && day === 14) {
      dateStr = "情人节";
  } else if (month === 5 && day === 1) {
      dateStr = "五一";
  } else if (month === 6 && day === 1) {
      dateStr = "儿童节";
  } else if (month === 10 && day === 1) {
      dateStr = "国庆节";
  } else if (month === 12 && day === 25) {
      dateStr = "圣诞节";
  } else {
      dateStr = false;
  }
  return dateStr;
}
export {
  getHolidays,
  getFestival,
  getWorks
}
